---
kind: method
id: M:Autodesk.Revit.DB.PolymeshFacet.#ctor(System.Int32,System.Int32,System.Int32)
source: html/c369fe0d-0e00-0aff-2ab5-edf2356355da.htm
---
# Autodesk.Revit.DB.PolymeshFacet.#ctor Method

Creates a PolymeshFacet with the supplied vertices.

## Syntax (C#)
```csharp
public PolymeshFacet(
	int v1,
	int v2,
	int v3
)
```

## Parameters
- **v1** (`System.Int32`) - The first vertex.
- **v2** (`System.Int32`) - The second vertex.
- **v3** (`System.Int32`) - The third vertex.